# Константы
ADM_SHORT_SUB = 20  # Знаков на тему письма в админке
MESSAGE_FREQ = 5  # Интервал отправки сообщений на фронтенд (шт.)
UNIQUE_LENGTH = 8  # Длина добавочного уникального имени файла

TABLE_SHORT_SUB = 30  # Знаков на тему письма в таблице
TABLE_SHORT_TEXT = 100  # Знаков на текст письма в таблице


# Тексты сообщений
AUTH = 'Аутентификация...'
AUTH_ERROR = 'Ошибка аутентификации.'
FILE_ERROR = 'Ошибка при сохранении файла:'
LOADING = 'Загружаю письма...'
MESSAGE_LIST_ERROR = 'Ошибка получения списка писем.'
NO_EMAILS = 'Новых писем нет.'
NO_SERVER = 'Не могу подключиться к этому серверу.'
SEARCH_START = 'Начинаю поиск новых писем...'
START_MESSAGE = 'Готов к загрузке...'
SUBJECT_ERROR = 'Ошибка в определении темы письма'
TEXT_ERROR = 'Не могу прочитать текст. Ошибка:'
UNCNOWN_EMAIL = 'Неизвестный email'
